cmsis-svd/cmsis-svd/data/Nuvoton/NANO100AN_v1.svd
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>GPIO port [x] pin [n] is in OUTPUT mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>GPIO port [x] pin [n] is in Open-Drain mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PMD15</name>
              <description>GPIO Port [X] Pin [N] Mode Control\nDetermine the I/O type of GPIO port [x] pin [n]\nNote: \nFor GPIOC_PMD, PMD4~PMD5 and PMD12~PMD13 are reserved.\nFor GPIOD_PMD, PMD0~PMD5 and PMD8~PMD13 are reserved.\nFor GPIOE_PMD, PMD0~PMD4 and PMD6~PMD15 are reserved.\nFor GPIOF_PMD, PMD2 ~ PMD15 are reserved.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>GPIO port [x] pin [n] is in INPUT mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>GPIO port [x] pin [n] is in OUTPUT mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>GPIO port [x] pin [n] is in Open-Drain mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>GPIOA_OFFD</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GPIOA_OFFD</displayName>
          <description>GPIO Port A Pin OFF Digital Enable Register</description>
          <addressOffset>0x4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OFFD0</name>
              <description>GPIO Port [X] Pin [N] Digital Input Path Disable\nDetermine if the digital input path of GPIO port [x] pin [n] is disabled.\nNote: \nFor GPIOC_OFFD, bits [21:20] and [29:28] are reserved.\nFor GPIOD_OFFD, bits [21:16] and [29:24] are reserved.\nFor GPIOE_OFFD, bits [20:16] and [31:22] are reserved.\nFor GPIOF_OFFD, bits [31:18] are reserved.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>digital input path of GPIO port [x] pin [n] Enabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>digital input path of GPIO port [x] pin [n] Disabled (tied digital input to low)</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFD1</name>
              <description>GPIO Port [X] Pin [N] Digital Input Path Disable\nDetermine if the digital input path of GPIO port [x] pin [n] is disabled.\nNote: \nFor GPIOC_OFFD, bits [21:20] and [29:28] are reserved.\nFor GPIOD_OFFD, bits [21:16] and [29:24] are reserved.\nFor GPIOE_OFFD, bits [20:16] and [31:22] are reserved.\nFor GPIOF_OFFD, bits [31:18] are reserved.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>digital input path of GPIO port [x] pin [n] Enabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>digital input path of GPIO port [x] pin [n] Disabled (tied digital input to low)</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFD2</name>
              <description>GPIO Port [X] Pin [N] Digital Input Path Disable\nDetermine if the digital input path of GPIO port [x] pin [n] is disabled.\nNote: \nFor GPIOC_OFFD, bits [21:20] and [29:28] are reserved.\nFor GPIOD_OFFD, bits [21:16] and [29:24] are reserved.\nFor GPIOE_OFFD, bits [20:16] and [31:22] are reserved.\nFor GPIOF_OFFD, bits [31:18] are reserved.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>digital input path of GPIO port [x] pin [n] Enabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>digital input path of GPIO port [x] pin [n] Disabled (tied digital input to low)</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFD3</name>
              <description>GPIO Port [X] Pin [N] Digital Input Path Disable\nDetermine if the digital input path of GPIO port [x] pin [n] is disabled.\nNote: \nFor GPIOC_OFFD, bits [21:20] and [29:28] are reserved.\nFor GPIOD_OFFD, bits [21:16] and [29:24] are reserved.\nFor GPIOE_OFFD, bits [20:16] and [31:22] are reserved.\nFor GPIOF_OFFD, bits [31:18] are reserved.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>digital input path of GPIO port [x] pin [n] Enabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>digital input path of GPIO port [x] pin [n] Disabled (tied digital input to low)</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFD4</name>
              <description>GPIO Port [X] Pin [N] Digital Input Path Disable\nDetermine if the digital input path of GPIO port [x] pin [n] is disabled.\nNote: \nFor GPIOC_OFFD, bits [21:20] and [29:28] are reserved.\nFor GPIOD_OFFD, bits [21:16] and [29:24] are reserved.\nFor GPIOE_OFFD, bits [20:16] and [31:22] are reserved.\nFor GPIOF_OFFD, bits [31:18] are reserved.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>digital input path of GPIO port [x] pin [n] Enabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>digital input path of GPIO port [x] pin [n] Disabled (tied digital input to low)</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFD5</name>
              <description>GPIO Port [X] Pin [N] Digital Input Path Disable\nDetermine if the digital input path of GPIO port [x] pin [n] is disabled.\nNote: \nFor GPIOC_OFFD, bits [21:20] and [29:28] are reserved.\nFor GPIOD_OFFD, bits [21:16] and [29:24] are reserved.\nFor GPIOE_OFFD, bits [20:16] and [31:22] are reserved.\nFor GPIOF_OFFD, bits [31:18] are reserved.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>digital input path of GPIO port [x] pin [n] Enabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>digital input path of GPIO port [x] pin [n] Disabled (tied digital input to low)</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFD6</name>
              <description>GPIO Port [X] Pin [N] Digital Input Path Disable\nDetermine if the digital input path of GPIO port [x] pin [n] is disabled.\nNote: \nFor GPIOC_OFFD, bits [21:20] and [29:28] are reserved.\nFor GPIOD_OFFD, bits [21:16] and [29:24] are reserved.\nFor GPIOE_OFFD, bits [20:16] and [31:22] are reserved.\nFor GPIOF_OFFD, bits [31:18] are reserved.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>digital input path of GPIO port [x] pin [n] Enabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>digital input path of GPIO port [x] pin [n] Disabled (tied digital input to low)</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFD7</name>
              <description>GPIO Port [X] Pin [N] Digital Input Path Disable\nDetermine if the digital input path of GPIO port [x] pin [n] is disabled.\nNote: \nFor GPIOC_OFFD, bits [21:20] and [29:28] are reserved.\nFor GPIOD_OFFD, bits [21:16] and [29:24] are reserved.\nFor GPIOE_OFFD, bits [20:16] and [31:22] are reserved.\nFor GPIOF_OFFD, bits [31:18] are reserved.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>digital input path of GPIO port [x] pin [n] Enabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>digital input path of GPIO port [x] pin [n] Disabled (tied digital input to low)</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFD8</name>
              <description>GPIO Port [X] Pin [N] Digital Input Path Disable\nDetermine if the digital input path of GPIO port [x] pin [n] is disabled.\nNote: \nFor GPIOC_OFFD, bits [21:20] and [29:28] are reserved.\nFor GPIOD_OFFD, bits [21:16] and [29:24] are reserved.\nFor GPIOE_OFFD, bits [20:16] and [31:22] are reserved.\nFor GPIOF_OFFD, bits [31:18] are reserved.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>digital input path of GPIO port [x] pin [n] Enabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>digital input path of GPIO port [x] pin [n] Disabled (tied digital input to low)</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFD9</name>
              <description>GPIO Port [X] Pin [N] Digital Input Path Disable\nDetermine if the digital input path of GPIO port [x] pin [n] is disabled.\nNote: \nFor GPIOC_OFFD, bits [21:20] and [29:28] are reserved.\nFor GPIOD_OFFD, bits [21:16] and [29:24] are reserved.\nFor GPIOE_OFFD, bits [20:16] and [31:22] are reserved.\nFor GPIOF_OFFD, bits [31:18] are reserved.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>digital input path of GPIO port [x] pin [n] Enabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>digital input path of GPIO port [x] pin [n] Disabled (tied digital input to low)</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFD10</name>
              <description>GPIO Port [X] Pin [N] Digital Input Path Disable\nDetermine if the digital input path of GPIO port [x] pin [n] is disabled.\nNote: \nFor GPIOC_OFFD, bits [21:20] and [29:28] are reserved.\nFor GPIOD_OFFD, bits [21:16] and [29:24] are reserved.\nFor GPIOE_OFFD, bits [20:16] and [31:22] are reserved.\nFor GPIOF_OFFD, bits [31:18] are reserved.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>digital input path of GPIO port [x] pin [n] Enabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>digital input path of GPIO port [x] pin [n] Disabled (tied digital input to low)</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFD11</name>
              <description>GPIO Port [X] Pin [N] Digital Input Path Disable\nDetermine if the digital input path of GPIO port [x] pin [n] is disabled.\nNote: \nFor GPIOC_OFFD, bits [21:20] and [29:28] are reserved.\nFor GPIOD_OFFD, bits [21:16] and [29:24] are reserved.\nFor GPIOE_OFFD, bits [20:16] and [31:22] are reserved.\nFor GPIOF_OFFD, bits [31:18] are reserved.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>digital input path of GPIO port [x] pin [n] Enabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>digital input path of GPIO port [x] pin [n] Disabled (tied digital input to low)</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFD12</name>
              <description>GPIO Port [X] Pin [N] Digital Input Path Disable\nDetermine if the digital input path of GPIO port [x] pin [n] is disabled.\nNote: \nFor GPIOC_OFFD, bits [21:20] and [29:28] are reserved.\nFor GPIOD_OFFD, bits [21:16] and [29:24] are reserved.\nFor GPIOE_OFFD, bits [20:16] and [31:22] are reserved.\nFor GPIOF_OFFD, bits [31:18] are reserved.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>digital input path of GPIO port [x] pin [n] Enabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>digital input path of GPIO port [x] pin [n] Disabled (tied digital input to low)</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFD13</name>
              <description>GPIO Port [X] Pin [N] Digital Input Path Disable\nDetermine if the digital input path of GPIO port [x] pin [n] is disabled.\nNote: \nFor GPIOC_OFFD, bits [21:20] and [29:28] are reserved.\nFor GPIOD_OFFD, bits [21:16] and [29:24] are reserved.\nFor GPIOE_OFFD, bits [20:16] and [31:22] are reserved.\nFor GPIOF_OFFD, bits [31:18] are reserved.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>digital input path of GPIO port [x] pin [n] Enabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>digital input path of GPIO port [x] pin [n] Disabled (tied digital input to low)</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFD14</name>
              <description>GPIO Port [X] Pin [N] Digital Input Path Disable\nDetermine if the digital input path of GPIO port [x] pin [n] is disabled.\nNote: \nFor GPIOC_OFFD, bits [21:20] and [29:28] are reserved.\nFor GPIOD_OFFD, bits [21:16] and [29:24] are reserved.\nFor GPIOE_OFFD, bits [20:16] and [31:22] are reserved.\nFor GPIOF_OFFD, bits [31:18] are reserved.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>digital input path of GPIO port [x] pin [n] Enabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>digital input path of GPIO port [x] pin [n] Disabled (tied digital input to low)</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFD15</name>
              <description>GPIO Port [X] Pin [N] Digital Input Path Disable\nDetermine if the digital input path of GPIO port [x] pin [n] is disabled.\nNote: \nFor GPIOC_OFFD, bits [21:20] and [29:28] are reserved.\nFor GPIOD_OFFD, bits [21:16] and [29:24] are reserved.\nFor GPIOE_OFFD, bits [20:16] and [31:22] are reserved.\nFor GPIOF_OFFD, bits [31:18] are reserved.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>digital input path of GPIO port [x] pin [n] Enabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>digital input path of GPIO port [x] pin [n] Disabled (tied digital input to low)</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
