cmsis-svd/cmsis-svd/data/Nuvoton/NANO100AN_v1.svd
                    <description>Level trigger interrupt</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>IMD13</name>
              <description>GPIO Port [X] Pin [N] Edge Or Level Detection Interrupt Control\nIMD[n] used to decide whether the interrupt is controlled by level trigger or by edge trigger. If the interrupt is controlled by edge trigger, the trigger source is sampled by de-bounce. If the interrupt is controlled by level trigger, the input source is sampled by one clock and the interrupt generates. \nIf set pin as the level trigger interrupt, then only one level can be set on the registers GPIOX_IER. If set both the level to trigger interrupt, the setting is ignored and no interrupt will occur\nThe de-bounce function is valid for edge triggered interrupt. If the interrupt mode is level triggered, the de-bounce enable bit is ignored.\nNote: \nFor GPIOC_IMD, bits [5:4] and [13:12] are reserved.\nFor GPIOD_IMD, bits [5:0] and [13:8] are reserved.\nFor GPIOE_IMD, bits [4:0] and [15:6] are reserved.\nFor GPIOF_IMD, bits [15:2] are reserved.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Edge trigger interrupt</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Level trigger interrupt</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>IMD14</name>
              <description>GPIO Port [X] Pin [N] Edge Or Level Detection Interrupt Control\nIMD[n] used to decide whether the interrupt is controlled by level trigger or by edge trigger. If the interrupt is controlled by edge trigger, the trigger source is sampled by de-bounce. If the interrupt is controlled by level trigger, the input source is sampled by one clock and the interrupt generates. \nIf set pin as the level trigger interrupt, then only one level can be set on the registers GPIOX_IER. If set both the level to trigger interrupt, the setting is ignored and no interrupt will occur\nThe de-bounce function is valid for edge triggered interrupt. If the interrupt mode is level triggered, the de-bounce enable bit is ignored.\nNote: \nFor GPIOC_IMD, bits [5:4] and [13:12] are reserved.\nFor GPIOD_IMD, bits [5:0] and [13:8] are reserved.\nFor GPIOE_IMD, bits [4:0] and [15:6] are reserved.\nFor GPIOF_IMD, bits [15:2] are reserved.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Edge trigger interrupt</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Level trigger interrupt</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>IMD15</name>
              <description>GPIO Port [X] Pin [N] Edge Or Level Detection Interrupt Control\nIMD[n] used to decide whether the interrupt is controlled by level trigger or by edge trigger. If the interrupt is controlled by edge trigger, the trigger source is sampled by de-bounce. If the interrupt is controlled by level trigger, the input source is sampled by one clock and the interrupt generates. \nIf set pin as the level trigger interrupt, then only one level can be set on the registers GPIOX_IER. If set both the level to trigger interrupt, the setting is ignored and no interrupt will occur\nThe de-bounce function is valid for edge triggered interrupt. If the interrupt mode is level triggered, the de-bounce enable bit is ignored.\nNote: \nFor GPIOC_IMD, bits [5:4] and [13:12] are reserved.\nFor GPIOD_IMD, bits [5:0] and [13:8] are reserved.\nFor GPIOE_IMD, bits [4:0] and [15:6] are reserved.\nFor GPIOF_IMD, bits [15:2] are reserved.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Edge trigger interrupt</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Level trigger interrupt</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>GPIOA_IER</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GPIOA_IER</displayName>
          <description>GPIO Port A Interrupt Enable Register</description>
          <addressOffset>0x1C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIER0</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable By Input Falling Edge Or Input Level Low\nFIER[n] is used to enable the interrupt for each of the corresponding input GPIO_PIN[n]. Set bit "1" also enable the pin wake-up function\nWhen set the FIER[n] bit "1":\nIf the interrupt is level mode trigger, the input PIN[n] state at level "low" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[n] state change from "high-to-low" will generate the interrupt.\nNote: \nFor GPIOC_IER, bits [5:4] and [13:12] are reserved.\nFor GPIOD_IER, bits [5:0] and [13:8] are reserved.\nFor GPIOE_IER, bits [4:0] and [15:6] are reserved.\nFor GPIOF_IER, bits [15:2] are reserved.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[n] state low-level or high-to-low change interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[n] state low-level or high-to-low change interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>FIER1</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable By Input Falling Edge Or Input Level Low\nFIER[n] is used to enable the interrupt for each of the corresponding input GPIO_PIN[n]. Set bit "1" also enable the pin wake-up function\nWhen set the FIER[n] bit "1":\nIf the interrupt is level mode trigger, the input PIN[n] state at level "low" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[n] state change from "high-to-low" will generate the interrupt.\nNote: \nFor GPIOC_IER, bits [5:4] and [13:12] are reserved.\nFor GPIOD_IER, bits [5:0] and [13:8] are reserved.\nFor GPIOE_IER, bits [4:0] and [15:6] are reserved.\nFor GPIOF_IER, bits [15:2] are reserved.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[n] state low-level or high-to-low change interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[n] state low-level or high-to-low change interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>FIER2</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable By Input Falling Edge Or Input Level Low\nFIER[n] is used to enable the interrupt for each of the corresponding input GPIO_PIN[n]. Set bit "1" also enable the pin wake-up function\nWhen set the FIER[n] bit "1":\nIf the interrupt is level mode trigger, the input PIN[n] state at level "low" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[n] state change from "high-to-low" will generate the interrupt.\nNote: \nFor GPIOC_IER, bits [5:4] and [13:12] are reserved.\nFor GPIOD_IER, bits [5:0] and [13:8] are reserved.\nFor GPIOE_IER, bits [4:0] and [15:6] are reserved.\nFor GPIOF_IER, bits [15:2] are reserved.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[n] state low-level or high-to-low change interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[n] state low-level or high-to-low change interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>FIER3</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable By Input Falling Edge Or Input Level Low\nFIER[n] is used to enable the interrupt for each of the corresponding input GPIO_PIN[n]. Set bit "1" also enable the pin wake-up function\nWhen set the FIER[n] bit "1":\nIf the interrupt is level mode trigger, the input PIN[n] state at level "low" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[n] state change from "high-to-low" will generate the interrupt.\nNote: \nFor GPIOC_IER, bits [5:4] and [13:12] are reserved.\nFor GPIOD_IER, bits [5:0] and [13:8] are reserved.\nFor GPIOE_IER, bits [4:0] and [15:6] are reserved.\nFor GPIOF_IER, bits [15:2] are reserved.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[n] state low-level or high-to-low change interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[n] state low-level or high-to-low change interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>FIER4</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable By Input Falling Edge Or Input Level Low\nFIER[n] is used to enable the interrupt for each of the corresponding input GPIO_PIN[n]. Set bit "1" also enable the pin wake-up function\nWhen set the FIER[n] bit "1":\nIf the interrupt is level mode trigger, the input PIN[n] state at level "low" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[n] state change from "high-to-low" will generate the interrupt.\nNote: \nFor GPIOC_IER, bits [5:4] and [13:12] are reserved.\nFor GPIOD_IER, bits [5:0] and [13:8] are reserved.\nFor GPIOE_IER, bits [4:0] and [15:6] are reserved.\nFor GPIOF_IER, bits [15:2] are reserved.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[n] state low-level or high-to-low change interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[n] state low-level or high-to-low change interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>FIER5</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable By Input Falling Edge Or Input Level Low\nFIER[n] is used to enable the interrupt for each of the corresponding input GPIO_PIN[n]. Set bit "1" also enable the pin wake-up function\nWhen set the FIER[n] bit "1":\nIf the interrupt is level mode trigger, the input PIN[n] state at level "low" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[n] state change from "high-to-low" will generate the interrupt.\nNote: \nFor GPIOC_IER, bits [5:4] and [13:12] are reserved.\nFor GPIOD_IER, bits [5:0] and [13:8] are reserved.\nFor GPIOE_IER, bits [4:0] and [15:6] are reserved.\nFor GPIOF_IER, bits [15:2] are reserved.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[n] state low-level or high-to-low change interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[n] state low-level or high-to-low change interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>FIER6</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable By Input Falling Edge Or Input Level Low\nFIER[n] is used to enable the interrupt for each of the corresponding input GPIO_PIN[n]. Set bit "1" also enable the pin wake-up function\nWhen set the FIER[n] bit "1":\nIf the interrupt is level mode trigger, the input PIN[n] state at level "low" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[n] state change from "high-to-low" will generate the interrupt.\nNote: \nFor GPIOC_IER, bits [5:4] and [13:12] are reserved.\nFor GPIOD_IER, bits [5:0] and [13:8] are reserved.\nFor GPIOE_IER, bits [4:0] and [15:6] are reserved.\nFor GPIOF_IER, bits [15:2] are reserved.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[n] state low-level or high-to-low change interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[n] state low-level or high-to-low change interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>FIER7</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable By Input Falling Edge Or Input Level Low\nFIER[n] is used to enable the interrupt for each of the corresponding input GPIO_PIN[n]. Set bit "1" also enable the pin wake-up function\nWhen set the FIER[n] bit "1":\nIf the interrupt is level mode trigger, the input PIN[n] state at level "low" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[n] state change from "high-to-low" will generate the interrupt.\nNote: \nFor GPIOC_IER, bits [5:4] and [13:12] are reserved.\nFor GPIOD_IER, bits [5:0] and [13:8] are reserved.\nFor GPIOE_IER, bits [4:0] and [15:6] are reserved.\nFor GPIOF_IER, bits [15:2] are reserved.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[n] state low-level or high-to-low change interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[n] state low-level or high-to-low change interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>FIER8</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable By Input Falling Edge Or Input Level Low\nFIER[n] is used to enable the interrupt for each of the corresponding input GPIO_PIN[n]. Set bit "1" also enable the pin wake-up function\nWhen set the FIER[n] bit "1":\nIf the interrupt is level mode trigger, the input PIN[n] state at level "low" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[n] state change from "high-to-low" will generate the interrupt.\nNote: \nFor GPIOC_IER, bits [5:4] and [13:12] are reserved.\nFor GPIOD_IER, bits [5:0] and [13:8] are reserved.\nFor GPIOE_IER, bits [4:0] and [15:6] are reserved.\nFor GPIOF_IER, bits [15:2] are reserved.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[n] state low-level or high-to-low change interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[n] state low-level or high-to-low change interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>FIER9</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable By Input Falling Edge Or Input Level Low\nFIER[n] is used to enable the interrupt for each of the corresponding input GPIO_PIN[n]. Set bit "1" also enable the pin wake-up function\nWhen set the FIER[n] bit "1":\nIf the interrupt is level mode trigger, the input PIN[n] state at level "low" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[n] state change from "high-to-low" will generate the interrupt.\nNote: \nFor GPIOC_IER, bits [5:4] and [13:12] are reserved.\nFor GPIOD_IER, bits [5:0] and [13:8] are reserved.\nFor GPIOE_IER, bits [4:0] and [15:6] are reserved.\nFor GPIOF_IER, bits [15:2] are reserved.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[n] state low-level or high-to-low change interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[n] state low-level or high-to-low change interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>FIER10</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable By Input Falling Edge Or Input Level Low\nFIER[n] is used to enable the interrupt for each of the corresponding input GPIO_PIN[n]. Set bit "1" also enable the pin wake-up function\nWhen set the FIER[n] bit "1":\nIf the interrupt is level mode trigger, the input PIN[n] state at level "low" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[n] state change from "high-to-low" will generate the interrupt.\nNote: \nFor GPIOC_IER, bits [5:4] and [13:12] are reserved.\nFor GPIOD_IER, bits [5:0] and [13:8] are reserved.\nFor GPIOE_IER, bits [4:0] and [15:6] are reserved.\nFor GPIOF_IER, bits [15:2] are reserved.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[n] state low-level or high-to-low change interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[n] state low-level or high-to-low change interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>FIER11</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable By Input Falling Edge Or Input Level Low\nFIER[n] is used to enable the interrupt for each of the corresponding input GPIO_PIN[n]. Set bit "1" also enable the pin wake-up function\nWhen set the FIER[n] bit "1":\nIf the interrupt is level mode trigger, the input PIN[n] state at level "low" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[n] state change from "high-to-low" will generate the interrupt.\nNote: \nFor GPIOC_IER, bits [5:4] and [13:12] are reserved.\nFor GPIOD_IER, bits [5:0] and [13:8] are reserved.\nFor GPIOE_IER, bits [4:0] and [15:6] are reserved.\nFor GPIOF_IER, bits [15:2] are reserved.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[n] state low-level or high-to-low change interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[n] state low-level or high-to-low change interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>FIER12</name>
