cmsis-svd/cmsis-svd/data/Nuvoton/NANO100AN_v1.svd
              <description>GPIO Port [X] Pin [N] Interrupt Enable By Input Falling Edge Or Input Level Low\nFIER[n] is used to enable the interrupt for each of the corresponding input GPIO_PIN[n]. Set bit "1" also enable the pin wake-up function\nWhen set the FIER[n] bit "1":\nIf the interrupt is level mode trigger, the input PIN[n] state at level "low" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[n] state change from "high-to-low" will generate the interrupt.\nNote: \nFor GPIOC_IER, bits [5:4] and [13:12] are reserved.\nFor GPIOD_IER, bits [5:0] and [13:8] are reserved.\nFor GPIOE_IER, bits [4:0] and [15:6] are reserved.\nFor GPIOF_IER, bits [15:2] are reserved.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[n] state low-level or high-to-low change interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[n] state low-level or high-to-low change interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>FIER13</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable By Input Falling Edge Or Input Level Low\nFIER[n] is used to enable the interrupt for each of the corresponding input GPIO_PIN[n]. Set bit "1" also enable the pin wake-up function\nWhen set the FIER[n] bit "1":\nIf the interrupt is level mode trigger, the input PIN[n] state at level "low" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[n] state change from "high-to-low" will generate the interrupt.\nNote: \nFor GPIOC_IER, bits [5:4] and [13:12] are reserved.\nFor GPIOD_IER, bits [5:0] and [13:8] are reserved.\nFor GPIOE_IER, bits [4:0] and [15:6] are reserved.\nFor GPIOF_IER, bits [15:2] are reserved.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[n] state low-level or high-to-low change interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[n] state low-level or high-to-low change interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>FIER14</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable By Input Falling Edge Or Input Level Low\nFIER[n] is used to enable the interrupt for each of the corresponding input GPIO_PIN[n]. Set bit "1" also enable the pin wake-up function\nWhen set the FIER[n] bit "1":\nIf the interrupt is level mode trigger, the input PIN[n] state at level "low" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[n] state change from "high-to-low" will generate the interrupt.\nNote: \nFor GPIOC_IER, bits [5:4] and [13:12] are reserved.\nFor GPIOD_IER, bits [5:0] and [13:8] are reserved.\nFor GPIOE_IER, bits [4:0] and [15:6] are reserved.\nFor GPIOF_IER, bits [15:2] are reserved.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[n] state low-level or high-to-low change interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[n] state low-level or high-to-low change interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>FIER15</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable By Input Falling Edge Or Input Level Low\nFIER[n] is used to enable the interrupt for each of the corresponding input GPIO_PIN[n]. Set bit "1" also enable the pin wake-up function\nWhen set the FIER[n] bit "1":\nIf the interrupt is level mode trigger, the input PIN[n] state at level "low" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[n] state change from "high-to-low" will generate the interrupt.\nNote: \nFor GPIOC_IER, bits [5:4] and [13:12] are reserved.\nFor GPIOD_IER, bits [5:0] and [13:8] are reserved.\nFor GPIOE_IER, bits [4:0] and [15:6] are reserved.\nFor GPIOF_IER, bits [15:2] are reserved.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[n] state low-level or high-to-low change interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[n] state low-level or high-to-low change interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RIER0</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable By Input Rising Edge Or Input Level High\nRIER[n] is used to enable the interrupt for each of the corresponding input GPIO_PIN[x]. Set bit "1" also enable the pin wake-up function \nWhen set the RIER[x] bit "1":\nIf the interrupt is level mode trigger, the input PIN[n] state at level "high" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[n] state change from "low-to-high" will generate the interrupt.\nNote: \nFor GPIOC_IER, bits [21:20] and [29:28] are reserved.\nFor GPIOD_IER, bits [21:16] and [29:24] are reserved.\nFor GPIOE_IER, bits [20:16] and [31:22] are reserved.\nFor GPIOF_IER, bits [31:18] are reserved.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[n] level-high or low-to-high interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[n] level-high or low-to-high interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RIER1</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable By Input Rising Edge Or Input Level High\nRIER[n] is used to enable the interrupt for each of the corresponding input GPIO_PIN[x]. Set bit "1" also enable the pin wake-up function \nWhen set the RIER[x] bit "1":\nIf the interrupt is level mode trigger, the input PIN[n] state at level "high" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[n] state change from "low-to-high" will generate the interrupt.\nNote: \nFor GPIOC_IER, bits [21:20] and [29:28] are reserved.\nFor GPIOD_IER, bits [21:16] and [29:24] are reserved.\nFor GPIOE_IER, bits [20:16] and [31:22] are reserved.\nFor GPIOF_IER, bits [31:18] are reserved.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[n] level-high or low-to-high interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[n] level-high or low-to-high interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RIER2</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable By Input Rising Edge Or Input Level High\nRIER[n] is used to enable the interrupt for each of the corresponding input GPIO_PIN[x]. Set bit "1" also enable the pin wake-up function \nWhen set the RIER[x] bit "1":\nIf the interrupt is level mode trigger, the input PIN[n] state at level "high" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[n] state change from "low-to-high" will generate the interrupt.\nNote: \nFor GPIOC_IER, bits [21:20] and [29:28] are reserved.\nFor GPIOD_IER, bits [21:16] and [29:24] are reserved.\nFor GPIOE_IER, bits [20:16] and [31:22] are reserved.\nFor GPIOF_IER, bits [31:18] are reserved.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[n] level-high or low-to-high interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[n] level-high or low-to-high interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RIER3</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable By Input Rising Edge Or Input Level High\nRIER[n] is used to enable the interrupt for each of the corresponding input GPIO_PIN[x]. Set bit "1" also enable the pin wake-up function \nWhen set the RIER[x] bit "1":\nIf the interrupt is level mode trigger, the input PIN[n] state at level "high" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[n] state change from "low-to-high" will generate the interrupt.\nNote: \nFor GPIOC_IER, bits [21:20] and [29:28] are reserved.\nFor GPIOD_IER, bits [21:16] and [29:24] are reserved.\nFor GPIOE_IER, bits [20:16] and [31:22] are reserved.\nFor GPIOF_IER, bits [31:18] are reserved.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[n] level-high or low-to-high interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[n] level-high or low-to-high interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RIER4</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable By Input Rising Edge Or Input Level High\nRIER[n] is used to enable the interrupt for each of the corresponding input GPIO_PIN[x]. Set bit "1" also enable the pin wake-up function \nWhen set the RIER[x] bit "1":\nIf the interrupt is level mode trigger, the input PIN[n] state at level "high" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[n] state change from "low-to-high" will generate the interrupt.\nNote: \nFor GPIOC_IER, bits [21:20] and [29:28] are reserved.\nFor GPIOD_IER, bits [21:16] and [29:24] are reserved.\nFor GPIOE_IER, bits [20:16] and [31:22] are reserved.\nFor GPIOF_IER, bits [31:18] are reserved.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[n] level-high or low-to-high interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[n] level-high or low-to-high interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RIER5</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable By Input Rising Edge Or Input Level High\nRIER[n] is used to enable the interrupt for each of the corresponding input GPIO_PIN[x]. Set bit "1" also enable the pin wake-up function \nWhen set the RIER[x] bit "1":\nIf the interrupt is level mode trigger, the input PIN[n] state at level "high" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[n] state change from "low-to-high" will generate the interrupt.\nNote: \nFor GPIOC_IER, bits [21:20] and [29:28] are reserved.\nFor GPIOD_IER, bits [21:16] and [29:24] are reserved.\nFor GPIOE_IER, bits [20:16] and [31:22] are reserved.\nFor GPIOF_IER, bits [31:18] are reserved.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[n] level-high or low-to-high interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[n] level-high or low-to-high interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RIER6</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable By Input Rising Edge Or Input Level High\nRIER[n] is used to enable the interrupt for each of the corresponding input GPIO_PIN[x]. Set bit "1" also enable the pin wake-up function \nWhen set the RIER[x] bit "1":\nIf the interrupt is level mode trigger, the input PIN[n] state at level "high" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[n] state change from "low-to-high" will generate the interrupt.\nNote: \nFor GPIOC_IER, bits [21:20] and [29:28] are reserved.\nFor GPIOD_IER, bits [21:16] and [29:24] are reserved.\nFor GPIOE_IER, bits [20:16] and [31:22] are reserved.\nFor GPIOF_IER, bits [31:18] are reserved.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[n] level-high or low-to-high interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[n] level-high or low-to-high interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RIER7</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable By Input Rising Edge Or Input Level High\nRIER[n] is used to enable the interrupt for each of the corresponding input GPIO_PIN[x]. Set bit "1" also enable the pin wake-up function \nWhen set the RIER[x] bit "1":\nIf the interrupt is level mode trigger, the input PIN[n] state at level "high" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[n] state change from "low-to-high" will generate the interrupt.\nNote: \nFor GPIOC_IER, bits [21:20] and [29:28] are reserved.\nFor GPIOD_IER, bits [21:16] and [29:24] are reserved.\nFor GPIOE_IER, bits [20:16] and [31:22] are reserved.\nFor GPIOF_IER, bits [31:18] are reserved.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[n] level-high or low-to-high interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[n] level-high or low-to-high interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RIER8</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable By Input Rising Edge Or Input Level High\nRIER[n] is used to enable the interrupt for each of the corresponding input GPIO_PIN[x]. Set bit "1" also enable the pin wake-up function \nWhen set the RIER[x] bit "1":\nIf the interrupt is level mode trigger, the input PIN[n] state at level "high" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[n] state change from "low-to-high" will generate the interrupt.\nNote: \nFor GPIOC_IER, bits [21:20] and [29:28] are reserved.\nFor GPIOD_IER, bits [21:16] and [29:24] are reserved.\nFor GPIOE_IER, bits [20:16] and [31:22] are reserved.\nFor GPIOF_IER, bits [31:18] are reserved.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[n] level-high or low-to-high interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[n] level-high or low-to-high interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RIER9</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable By Input Rising Edge Or Input Level High\nRIER[n] is used to enable the interrupt for each of the corresponding input GPIO_PIN[x]. Set bit "1" also enable the pin wake-up function \nWhen set the RIER[x] bit "1":\nIf the interrupt is level mode trigger, the input PIN[n] state at level "high" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[n] state change from "low-to-high" will generate the interrupt.\nNote: \nFor GPIOC_IER, bits [21:20] and [29:28] are reserved.\nFor GPIOD_IER, bits [21:16] and [29:24] are reserved.\nFor GPIOE_IER, bits [20:16] and [31:22] are reserved.\nFor GPIOF_IER, bits [31:18] are reserved.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[n] level-high or low-to-high interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[n] level-high or low-to-high interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RIER10</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable By Input Rising Edge Or Input Level High\nRIER[n] is used to enable the interrupt for each of the corresponding input GPIO_PIN[x]. Set bit "1" also enable the pin wake-up function \nWhen set the RIER[x] bit "1":\nIf the interrupt is level mode trigger, the input PIN[n] state at level "high" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[n] state change from "low-to-high" will generate the interrupt.\nNote: \nFor GPIOC_IER, bits [21:20] and [29:28] are reserved.\nFor GPIOD_IER, bits [21:16] and [29:24] are reserved.\nFor GPIOE_IER, bits [20:16] and [31:22] are reserved.\nFor GPIOF_IER, bits [31:18] are reserved.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[n] level-high or low-to-high interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[n] level-high or low-to-high interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RIER11</name>
              <description>GPIO Port [X] Pin [N] Interrupt Enable By Input Rising Edge Or Input Level High\nRIER[n] is used to enable the interrupt for each of the corresponding input GPIO_PIN[x]. Set bit "1" also enable the pin wake-up function \nWhen set the RIER[x] bit "1":\nIf the interrupt is level mode trigger, the input PIN[n] state at level "high" will generate the interrupt.\nIf the interrupt is edge mode trigger, the input PIN[n] state change from "low-to-high" will generate the interrupt.\nNote: \nFor GPIOC_IER, bits [21:20] and [29:28] are reserved.\nFor GPIOD_IER, bits [21:16] and [29:24] are reserved.\nFor GPIOE_IER, bits [20:16] and [31:22] are reserved.\nFor GPIOF_IER, bits [31:18] are reserved.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[n] level-high or low-to-high interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[n] level-high or low-to-high interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
