cmsis-svd/cmsis-svd/data/Nuvoton/NANO100AN_v1.svd
       <register derivedFrom="GPIOA0">
          <name>GPIOA1</name>
          <displayName>GPIOA1</displayName>
          <description>GPIO Port A Bit 1 Data Register</description>
          <addressOffset>0x204</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOA2</name>
          <displayName>GPIOA2</displayName>
          <description>GPIO Port A Bit 2 Data Register</description>
          <addressOffset>0x208</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOA3</name>
          <displayName>GPIOA3</displayName>
          <description>GPIO Port A Bit 3 Data Register</description>
          <addressOffset>0x20C</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOA4</name>
          <displayName>GPIOA4</displayName>
          <description>GPIO Port A Bit 4 Data Register</description>
          <addressOffset>0x210</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOA5</name>
          <displayName>GPIOA5</displayName>
          <description>GPIO Port A Bit 5 Data Register</description>
          <addressOffset>0x214</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOA6</name>
          <displayName>GPIOA6</displayName>
          <description>GPIO Port A Bit 6 Data Register</description>
          <addressOffset>0x218</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOA7</name>
          <displayName>GPIOA7</displayName>
          <description>GPIO Port A Bit 7 Data Register</description>
          <addressOffset>0x21C</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOA8</name>
          <displayName>GPIOA8</displayName>
          <description>GPIO Port A Bit 8 Data Register</description>
          <addressOffset>0x220</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOA9</name>
          <displayName>GPIOA9</displayName>
          <description>GPIO Port A Bit 9 Data Register</description>
          <addressOffset>0x224</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOA10</name>
          <displayName>GPIOA10</displayName>
          <description>GPIO Port A Bit 10 Data Register</description>
          <addressOffset>0x228</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOA11</name>
          <displayName>GPIOA11</displayName>
          <description>GPIO Port A Bit 11 Data Register</description>
          <addressOffset>0x22C</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOA12</name>
          <displayName>GPIOA12</displayName>
          <description>GPIO Port A Bit 12 Data Register</description>
          <addressOffset>0x230</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOA13</name>
          <displayName>GPIOA13</displayName>
          <description>GPIO Port A Bit 13 Data Register</description>
          <addressOffset>0x234</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOA14</name>
          <displayName>GPIOA14</displayName>
          <description>GPIO Port A Bit 14 Data Register</description>
          <addressOffset>0x238</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOA15</name>
          <displayName>GPIOA15</displayName>
          <description>GPIO Port A Bit 15 Data Register</description>
          <addressOffset>0x23C</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOB0</name>
          <displayName>GPIOB0</displayName>
          <description>GPIO Port B Bit 0 Data Register</description>
          <addressOffset>0x240</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOB1</name>
          <displayName>GPIOB1</displayName>
          <description>GPIO Port B Bit 1 Data Register</description>
          <addressOffset>0x244</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOB2</name>
          <displayName>GPIOB2</displayName>
          <description>GPIO Port B Bit 2 Data Register</description>
          <addressOffset>0x248</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOB3</name>
          <displayName>GPIOB3</displayName>
          <description>GPIO Port B Bit 3 Data Register</description>
          <addressOffset>0x24C</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOB4</name>
          <displayName>GPIOB4</displayName>
          <description>GPIO Port B Bit 4 Data Register</description>
          <addressOffset>0x250</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOB5</name>
          <displayName>GPIOB5</displayName>
          <description>GPIO Port B Bit 5 Data Register</description>
          <addressOffset>0x254</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOB6</name>
          <displayName>GPIOB6</displayName>
          <description>GPIO Port B Bit 6 Data Register</description>
          <addressOffset>0x258</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOB7</name>
          <displayName>GPIOB7</displayName>
          <description>GPIO Port B Bit 7 Data Register</description>
          <addressOffset>0x25C</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOB8</name>
          <displayName>GPIOB8</displayName>
          <description>GPIO Port B Bit 8 Data Register</description>
          <addressOffset>0x260</addressOffset>
       </register>
