cmsis-svd/cmsis-svd/data/Nuvoton/NANO100AN_v1.svd
       <register derivedFrom="GPIOA0">
          <name>GPIOD1</name>
          <displayName>GPIOD1</displayName>
          <description>GPIO Port D Bit 1 Data Register</description>
          <addressOffset>0x2C4</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOD2</name>
          <displayName>GPIOD2</displayName>
          <description>GPIO Port D Bit 2 Data Register</description>
          <addressOffset>0x2C8</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOD3</name>
          <displayName>GPIOD3</displayName>
          <description>GPIO Port D Bit 3 Data Register</description>
          <addressOffset>0x2CC</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOD4</name>
          <displayName>GPIOD4</displayName>
          <description>GPIO Port D Bit 4 Data Register</description>
          <addressOffset>0x2D0</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOD5</name>
          <displayName>GPIOD5</displayName>
          <description>GPIO Port D Bit 5 Data Register</description>
          <addressOffset>0x2D4</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOD6</name>
          <displayName>GPIOD6</displayName>
          <description>GPIO Port D Bit 6 Data Register</description>
          <addressOffset>0x2D8</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOD7</name>
          <displayName>GPIOD7</displayName>
          <description>GPIO Port D Bit 7 Data Register</description>
          <addressOffset>0x2DC</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOD8</name>
          <displayName>GPIOD8</displayName>
          <description>GPIO Port D Bit 8 Data Register</description>
          <addressOffset>0x2E0</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOD9</name>
          <displayName>GPIOD9</displayName>
          <description>GPIO Port D Bit 9 Data Register</description>
          <addressOffset>0x2E4</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOD10</name>
          <displayName>GPIOD10</displayName>
          <description>GPIO Port D Bit 10 Data Register</description>
          <addressOffset>0x2E8</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOD11</name>
          <displayName>GPIOD11</displayName>
          <description>GPIO Port D Bit 11 Data Register</description>
          <addressOffset>0x2EC</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOD12</name>
          <displayName>GPIOD12</displayName>
          <description>GPIO Port D Bit 12 Data Register</description>
          <addressOffset>0x2F0</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOD13</name>
          <displayName>GPIOD13</displayName>
          <description>GPIO Port D Bit 13 Data Register</description>
          <addressOffset>0x2F4</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOD14</name>
          <displayName>GPIOD14</displayName>
          <description>GPIO Port D Bit 14 Data Register</description>
          <addressOffset>0x2F8</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOD15</name>
          <displayName>GPIOD15</displayName>
          <description>GPIO Port D Bit 15 Data Register</description>
          <addressOffset>0x2FC</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOE0</name>
          <displayName>GPIOE0</displayName>
          <description>GPIO Port E Bit 0 Data Register</description>
          <addressOffset>0x300</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOE1</name>
          <displayName>GPIOE1</displayName>
          <description>GPIO Port E Bit 1 Data Register</description>
          <addressOffset>0x304</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOE2</name>
          <displayName>GPIOE2</displayName>
          <description>GPIO Port E Bit 2 Data Register</description>
          <addressOffset>0x308</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOE3</name>
          <displayName>GPIOE3</displayName>
          <description>GPIO Port E Bit 3 Data Register</description>
          <addressOffset>0x30C</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOE4</name>
          <displayName>GPIOE4</displayName>
          <description>GPIO Port E Bit 4 Data Register</description>
          <addressOffset>0x310</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOE5</name>
          <displayName>GPIOE5</displayName>
          <description>GPIO Port E Bit 5 Data Register</description>
          <addressOffset>0x314</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOE6</name>
          <displayName>GPIOE6</displayName>
          <description>GPIO Port E Bit 6 Data Register</description>
          <addressOffset>0x318</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOE7</name>
          <displayName>GPIOE7</displayName>
          <description>GPIO Port E Bit 7 Data Register</description>
          <addressOffset>0x31C</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOE8</name>
          <displayName>GPIOE8</displayName>
          <description>GPIO Port E Bit 8 Data Register</description>
          <addressOffset>0x320</addressOffset>
       </register>
