cmsis-svd/cmsis-svd/data/Nuvoton/NANO100AN_v1.svd
       <register>
          <name>PWM0_CFL0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PWM0_CFL0</displayName>
          <description>Capture Falling Latch Register (Channel 0)</description>
          <addressOffset>0x64</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFL</name>
              <description>Capture Falling Latch Register\nLatch the PWM counter when Channel 01/2/3 has Falling transition.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFL_H</name>
              <description>Upper Half Word Of 32 Bit Capture Data When Cascade Is Enable \nWhen cascade is enabled for capture channel 0, 2,the original 16 bit counter extend to 32 bit, and capture result CFL0 and CFL2 are also extend to 32 bit,</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="PWM0_CFL0">
          <name>PWM1_CFL0</name>
          <displayName>PWM1_CFL0</displayName>
          <description>Capture Falling Latch Register (Channel 0)</description>
          <alternateRegister>PWM0_CFL0</alternateRegister>
          <addressOffset>0x64</addressOffset>
       </register>
       <register derivedFrom="PWM0_CRL0">
          <name>PWM0_CRL1</name>
          <displayName>PWM0_CRL1</displayName>
          <description>Capture Rising Latch Register (Channel 1)</description>
          <addressOffset>0x68</addressOffset>
       </register>
       <register derivedFrom="PWM0_CRL1">
          <name>PWM1_CRL1</name>
          <displayName>PWM1_CRL1</displayName>
          <description>Capture Rising Latch Register (Channel 1)</description>
          <alternateRegister>PWM0_CRL1</alternateRegister>
          <addressOffset>0x68</addressOffset>
       </register>
       <register derivedFrom="PWM0_CFL0">
          <name>PWM0_CFL1</name>
          <displayName>PWM0_CFL1</displayName>
          <description>Capture Falling Latch Register (Channel 1)</description>
          <addressOffset>0x6C</addressOffset>
       </register>
       <register derivedFrom="PWM0_CFL1">
          <name>PWM1_CFL1</name>
          <displayName>PWM1_CFL1</displayName>
          <description>Capture Falling Latch Register (Channel 1)</description>
          <alternateRegister>PWM0_CFL1</alternateRegister>
          <addressOffset>0x6C</addressOffset>
       </register>
       <register derivedFrom="PWM0_CRL0">
          <name>PWM0_CRL2</name>
          <displayName>PWM0_CRL2</displayName>
          <description>Capture Rising Latch Register (Channel 2)</description>
          <addressOffset>0x70</addressOffset>
       </register>
       <register derivedFrom="PWM0_CRL2">
          <name>PWM1_CRL2</name>
          <displayName>PWM1_CRL2</displayName>
          <description>Capture Rising Latch Register (Channel 2)</description>
          <alternateRegister>PWM0_CRL2</alternateRegister>
          <addressOffset>0x70</addressOffset>
       </register>
       <register derivedFrom="PWM0_CFL0">
          <name>PWM0_CFL2</name>
          <displayName>PWM0_CFL2</displayName>
          <description>Capture Falling Latch Register (Channel 2)</description>
          <addressOffset>0x74</addressOffset>
       </register>
       <register derivedFrom="PWM0_CFL2">
          <name>PWM1_CFL2</name>
          <displayName>PWM1_CFL2</displayName>
          <description>Capture Falling Latch Register (Channel 2)</description>
          <alternateRegister>PWM0_CFL2</alternateRegister>
          <addressOffset>0x74</addressOffset>
       </register>
       <register derivedFrom="PWM0_CRL0">
          <name>PWM0_CRL3</name>
          <displayName>PWM0_CRL3</displayName>
          <description>Capture Rising Latch Register (Channel 3)</description>
          <addressOffset>0x78</addressOffset>
       </register>
       <register derivedFrom="PWM0_CRL3">
          <name>PWM1_CRL3</name>
          <displayName>PWM1_CRL3</displayName>
          <description>Capture Rising Latch Register (Channel 3)</description>
          <alternateRegister>PWM0_CRL3</alternateRegister>
          <addressOffset>0x78</addressOffset>
       </register>
       <register derivedFrom="PWM0_CFL0">
          <name>PWM0_CFL3</name>
          <displayName>PWM0_CFL3</displayName>
          <description>Capture Falling Latch Register (Channel 3)</description>
          <addressOffset>0x7C</addressOffset>
       </register>
       <register derivedFrom="PWM0_CFL3">
          <name>PWM1_CFL3</name>
          <displayName>PWM1_CFL3</displayName>
          <description>Capture Falling Latch Register (Channel 3)</description>
          <alternateRegister>PWM0_CFL3</alternateRegister>
          <addressOffset>0x7C</addressOffset>
       </register>
       <register>
          <name>PWM0_PDMACH0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PWM0_PDMACH0</displayName>
          <description>PDMA Channel 0 Captured Data</description>
          <addressOffset>0x80</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDMACH01</name>
              <description>Captured Data Of Channel 0\nWhen CH01CASK is disabled, it is the capturing value(CFL0/CRL0) for channel 0\nWhen CH01CASK is enabled, It is the for the first byte of 32 bit capturing data for channel 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PDMACH02</name>
              <description>Captured Data Of Channel 0\nWhen CH01CASK is disabled, it is the capturing value(CFL0/CRL0) for channel 0\nWhen CH01CASK is enabled, It is the second byte of 32 bit capturing data for channel 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PDMACH03</name>
              <description>Captured Data Of Channel 0\nWhen CH01CASK is disabled, this byte is 0\nWhen CH01CASK is enabled, It is the third byte of 32 bit capturing data for channel 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PDMACH04</name>
              <description>Captured Data Of Channel 0\nWhen CH01CASK is disabled, this byte is 0\nWhen CH01CASK is enabled, It is the fourth byte of 32 bit capturing data for channel 0</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="PWM0_PDMACH0">
          <name>PWM1_PDMACH0</name>
          <displayName>PWM1_PDMACH0</displayName>
          <description>PDMA Channel 0 Captured Data</description>
          <alternateRegister>PWM0_PDMACH0</alternateRegister>
          <addressOffset>0x80</addressOffset>
       </register>
       <register>
          <name>PWM0_PDMACH2</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PWM0_PDMACH2</displayName>
          <description>PDMA Channel 2 Captured Data</description>
          <addressOffset>0x84</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDMACH21</name>
              <description>Captured Data Of Channel 2\nWhen CH23CASK is disabled, it is the capturing value(CFL0/CRL0) for channel 2\nWhen CH23CASK is enabled, It is the for the first byte of 32 bit capturing data for channel 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PDMACH22</name>
              <description>Captured Data Of Channel 2\nWhen CH23CASK is disabled, it is the capturing value(CFL0/CRL0) for channel 2\nWhen CH23CASK is enabled, It is the second byte of 32 bit capturing data for channel 2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PDMACH23</name>
              <description>Captured Data Of Channel 2\nWhen CH23CASK is disabled, this byte is 0\nWhen CH23CASK is enabled, It is the third byte of 32 bit capturing data for channel 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PDMACH24</name>
              <description>Captured Data Of Channel 2\nWhen CH23CASK is disabled, this byte is 0\nWhen CH23CASK is enabled, It is the fourth byte of 32 bit capturing data for channel 2</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="PWM0_PDMACH2">
          <name>PWM1_PDMACH2</name>
          <displayName>PWM1_PDMACH2</displayName>
          <description>PDMA Channel 2 Captured Data</description>
          <alternateRegister>PWM0_PDMACH2</alternateRegister>
          <addressOffset>0x84</addressOffset>
       </register>
